# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-09-10 18:34:36 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Boring [2/3]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A boring idle-clicker game
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-09-10 Mi 18:34]
   | Headline                                   | Time   |        |      |      |
   |--------------------------------------------+--------+--------+------+------|
   | *Total time*                               | *0:43* |        |      |      |
   |--------------------------------------------+--------+--------+------+------|
   | *Boring [2/3]*                             | *0:43* |        |      |      |
   | \_  /Features [1/2]/                       |        | /0:30/ |      |      |
   | \_    Persistence                          |        |        | 0:30 |      |
   | \_  /Components [1/1]/                     |        | /0:13/ |      |      |
   | \_    Engine [1/1]                         |        |        | 0:13 |      |
   | \_      Move as much state and logic as... |        |        |      | 0:13 |
   #+END:
** Features [1/2]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** DONE Persistence
    CLOSED: [2025-09-10 Mi 18:19]
    :LOGBOOK:
    CLOCK: [2025-09-10 Mi 17:49]--[2025-09-10 Mi 18:19] =>  0:30
    :END:
*** TODO Reset for great price!
** Components [1/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** GUI [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
*** Engine [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
**** DONE Move as much state and logic as possible into the game engine
     CLOSED: [2025-09-10 Mi 18:34]
     :LOGBOOK:
     CLOCK: [2025-09-10 Mi 18:21]--[2025-09-10 Mi 18:34] =>  0:13
     :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
